<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/data/MarioBrosPlumbing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
# Connect sql magic
%load_ext sql
%sql sqlite:///mario_bros_plumbing.db

In [5]:
%%sql
CREATE TABLE Customers (
  customer_id INTEGER PRIMARY KEY,
  first_name VARCHAR(255),
  last_name VARCHAR(255),
  address JSON,
  phone_number VARCHAR(20)
);

CREATE TABLE Employees (
  employee_id INTEGER PRIMARY KEY,
  first_name VARCHAR(255),
  last_name VARCHAR(255),
  job_title VARCHAR(255),
  hire_date DATE
);

CREATE TABLE ServiceTypes (
  service_type_id INTEGER PRIMARY KEY,
  service_type_name VARCHAR(255),
  description VARCHAR(255)
);

  CREATE TABLE Services (
  service_id INTEGER PRIMARY KEY,
  service_type_id INTEGER,
  service_name VARCHAR(255),
  description VARCHAR(255),
  price DECIMAL(10,2),
  FOREIGN KEY (service_type_id) REFERENCES ServiceTypes (service_type_id)
);

CREATE TABLE Orders (
  -- Keeps track of a customer's orders
  order_id INTEGER PRIMARY KEY,
  customer_id INTEGER,
  employee_id INTEGER,
  order_date DATE,
  total_amount DECIMAL(10,2),
  FOREIGN KEY (customer_id) REFERENCES Customers (customer_id),
  FOREIGN KEY (employee_id) REFERENCES Employees (employee_id)
);


CREATE TABLE Order_Items (
  -- Keeps track of a customer's order items
  -- This is one line on an invoice
  order_item_id INTEGER PRIMARY KEY,
  order_id INTEGER,
  service_id INTEGER,
  quantity INTEGER,
  FOREIGN KEY (order_id) REFERENCES Orders (order_id),
  FOREIGN KEY (service_id) REFERENCES Services (service_id)
);

 * sqlite:///mario_bros_plumbing.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [6]:
import base64
from IPython.display import Image, display, HTML

def mm(graph):
    graphbytes = graph.encode("utf8")
    base64_bytes = base64.b64encode(graphbytes)
    base64_string = base64_bytes.decode("ascii")
    display(Image(url="https://mermaid.ink/img/" + base64_string))

mm("""
classDiagram
    Customers "1" -- "*" Orders
    Employees "1" -- "*" Orders
    Orders "1" -- "*" Order_Items
    Services "1" -- "*" Order_Items
    ServiceTypes <|-- Services

    class Customers {
        +customer_id: INTEGER PK
        +first_name: VARCHAR
        +last_name: VARCHAR
        +address: JSON
        +phone_number: VARCHAR
    }

    class Employees {
        +employee_id: INTEGER PK
        +first_name: VARCHAR
        +last_name: VARCHAR
        +job_title: VARCHAR
        +hire_date: DATE
    }

    class ServiceTypes {
        +service_type_id: INTEGER PK
        +service_type_name: VARCHAR
        +description: VARCHAR
    }

    class Services {
        +service_id: INTEGER PK
        +service_type_id: INTEGER FK
        +service_name: VARCHAR
        +description: VARCHAR
        +price: DECIMAL
    }

    class Orders {
        +order_id: INTEGER PK
        +customer_id: INTEGER FK
        +employee_id: INTEGER FK
        +order_date: DATE
        +total_amount: DECIMAL
    }

    class Order_Items {
        +order_item_id: INTEGER PK
        +order_id: INTEGER FK
        +service_id: INTEGER FK
        +quantity: INTEGER
    }
""")

## Guide to Interpreting a UML Entity-Relationship Diagram
THe above diagram is in **Unified Modeling Language.** This is similar to the Crow's foot style we saw before, but with a few key differences.

### Entities:
  -   In UML, entities are represented as classes, which are depicted as rectangles.
  -   Each entity (class) is labeled with its name at the top of the rectangle.
  -   The attributes of an entity are listed inside the rectangle, below the entity name.
  -   In this diagram, the entities are Customers, Employees, ServiceTypes, Services, Orders, and Order_Items.
  
### Attributes
  -   Attributes represent the properties or characteristics of an entity.
  -   Each attribute is listed on a separate line within the entity's rectangle.
  -   The attribute name is followed by a colon (`:`) and its data type.
  -   Primary key attributes are marked with `PK`, indicating that they uniquely identify each record in the entity.
  -   Foreign key attributes are marked with `FK`, indicating that they establish relationships with other entities.

### Relationships
  -   Relationships between entities are represented by lines connecting the rectangles.
  -   The cardinality of a relationship is indicated at each end of the line.
  -   In this diagram, a single number (`1`) represents a one-to-one or one-to-many relationship, while an asterisk (`*`) represents a many-to-one or many-to-many relationship.
  -   For example, the line between Customers and Orders with `1` on the Customers end and `*` on the Orders end indicates that one customer can have multiple orders (a one-to-many relationship).

### Inheritance (Sub-Type / Super-Type)
  -   Inheritance is a concept in object-oriented modeling where one entity (**subclass**) inherits the attributes and behaviors of another entity (**superclass**).
  -   In UML, inheritance is represented by a line with a hollow arrowhead pointing from the subclass to the superclass.
  -   In this diagram, the inheritance relationship is shown between Services and ServiceTypes, with Services inheriting from ServiceTypes.
    
### Reading the Diagram:
  -   Start by identifying the entities (classes) in the diagram, which are represented by rectangles.
  -   Look at the attributes within each entity to understand the properties and characteristics of each entity.
  -   Identify the primary key attributes marked with `<<PK>>` and foreign key attributes marked with `<<FK>>`.
  -   Follow the lines connecting the entities to understand the relationships between them.
  -   Look at the cardinality indicators (`1` or `*`) to determine the nature of the relationships (one-to-one, one-to-many, many-to-one, or many-to-many).
  -   Observe any inheritance relationships, where one entity inherits from another, indicated by a line with a hollow arrowhead.

In [7]:
%%sql
INSERT INTO Employees (employee_id, first_name, last_name, job_title, hire_date)
VALUES
  (1, 'Super', 'Mario', 'Master Plumber', '2000-09-13'),
  (2, 'Super', 'Luigi', 'Journeyman Plumber', '2003-02-20'),
  (3, 'Princess', 'Peach', 'Project Manager', '2005-06-10'),
  (4, 'Cat', 'Peach', 'Apprentice Plumber', '2014-11-05'),
  (5, 'Tanuki', 'Mario', 'Plumbing Technician', '2011-04-28'),
  (6, 'Fire', 'Luigi', 'HVAC Specialist', '2008-12-03'),
  (7, 'Toad', 'Toadstool', 'Dispatch Coordinator', '2018-07-15');

 * sqlite:///mario_bros_plumbing.db
7 rows affected.

[]

In [8]:
%%sql
INSERT INTO Customers (customer_id, first_name, last_name, address, phone_number)
VALUES
  (1, 'Peach', 'Toadstool', '{"street": "Mushroom Castle", "city": "Toad Town"}', '(555) 123-4567'),
  (2, 'Yoshi', 'Dino', '{"street": "24 Egg Island", "city": "Dinosaur Land", "apartment": "A"}', '(555) 987-6543'),
  (3, 'Daisy', 'Sarasa', '{"street": "10 Sarasaland Way", "city": "Chai Kingdom"}', '(555) 456-7890'),
  (4, 'Toadette', 'Toadstool', '{"street": "15 Mushroom St", "city": "Toad Town", "apartment": "2B"}', '(555) 789-0123'),
  (5, 'Bowser', 'Koopa', '{"street": "1 Bowser Castle", "city": "Dark Land"}', '(555) 654-3210'),
  (6, 'Wario', 'Wario', '{"street": "100 Gold Coin Blvd", "city": "Diamond City"}', '(555) 321-0987'),
  (7, 'Waluigi', 'Wario', '{"street": "101 Silver Coin Ave", "city": "Diamond City", "unit": "5C"}', '(555) 098-7654'),
  (8, 'Donkey', 'Kong', '{"street": "50 Banana Jungle", "city": "DK Island", "house": "Treehouse"}', '(555) 111-2222'),
  (9, 'Diddy', 'Kong', '{"street": "51 Banana Jungle", "city": "DK Island", "floor": "Ground"}', '(555) 333-4444'),
  (10, 'Rosalina', 'Cosmic', '{"street": "Comet Observatory", "city": "Space"}', '(555) 555-6666'),
  (11, 'Cappy', 'Bonneter', '{"street": "1 Hat Kingdom Way", "city": "Cap Kingdom"}', '(555) 777-8888'),
  (12, 'Pauline', 'Toyopolis', '{"street": "1 New Donk City Plaza", "city": "Metro Kingdom"}', '(555) 999-0000'),
  (13, 'Link', 'Hyrule', '{"street": "1 Hyrule Castle", "city": "Hyrule Kingdom"}', '(555) 234-5678'),
  (14, 'Zelda', 'Hyrule', '{"street": "2 Hyrule Castle", "city": "Hyrule Kingdom"}', '(555) 345-6789'),
  (15, 'Samus', 'Aran', '{"street": "10 Bounty Hunter Ave", "city": "Space Colony K-2L"}', '(555) 456-7890'),
  (16, 'Fox', 'McCloud', '{"street": "20 Corneria St", "city": "Lylat System"}', '(555) 567-8901'),
  (17, 'Pikachu', 'Pokemon', '{"street": "30 Electric Rodent Rd", "city": "Kanto Region", "box": "P.O. Box 101"}', '(555) 678-9012'),
  (18, 'Kirby', 'Puffball', '{"street": "40 Dream Land Ln", "city": "Planet Popstar", "unit": "Suite 3"}', '(555) 789-0123'),
  (19, 'Captain', 'Falcon', '{"street": "50 Mute City Blvd", "city": "Port Town"}', '(555) 890-1234'),
  (20, 'Ness', 'Earthbound', '{"street": "60 Onett Ave", "city": "Eagleland"}', '(555) 901-2345'),
  (21, 'Marth', 'Altea', '{"street": "70 Fire Emblem St", "city": "Kingdom of Altea"}', '(555) 012-3456'),
  (22, 'Roy', 'Pherae', '{"street": "71 Fire Emblem St", "city": "Lycia"}', '(555) 123-4567'),
  (23, 'Toad', 'Toadstool', '{"street": "80 Mushroom Way", "city": "Toad Town", "building": "Toad Hall"}', '(555) 234-5678'),
  (24, 'Koopa', 'Troopa', '{"street": "90 Shell Blvd", "city": "Dark Land"}', '(555) 345-6789'),
  (25, 'Dry', 'Bones', '{"street": "91 Bone Yard Rd", "city": "Dark Land", "crypt": "Lower"}', '(555) 456-7890'),
  (26, 'Shy', 'Guy', '{"street": "100 Mask St", "city": "Dark Land"}', '(555) 567-8901'),
  (27, 'Lakitu', 'Cloud', '{"street": "110 Cloud Way", "city": "Skyworld", "apartment": "Skyview"}', '(555) 678-9012'),
  (28, 'Toadsworth', 'Toadstool', '{"street": "120 Cane Ln", "city": "Toad Town"}', '(555) 789-0123'),
  (29, 'Birdo', 'Egg', '{"street": "130 Egg Shooter Ave", "city": "Subcon"}', '(555) 890-1234'),
  (30, 'Nabbit', 'Thief', '{"street": "140 Burglar Blvd", "city": "Acorn Plains"}', '(555) 901-2345'),
  (31, 'Funky', 'Kong', '{"street": "150 Surf Shop St", "city": "DK Island", "shack": "Beachside"}', '(555) 012-3456'),
  (32, 'Cranky', 'Kong', '{"street": "160 Rocking Chair Rd", "city": "DK Island"}', '(555) 123-4567');

 * sqlite:///mario_bros_plumbing.db
32 rows affected.

[]

In [9]:
%%sql
INSERT INTO ServiceTypes (service_type_id, service_type_name, description)
VALUES
  (1, 'Repair', 'Services related to fixing and repairing plumbing issues'),
  (2, 'Installation', 'Services related to installing new plumbing fixtures and systems'),
  (3, 'Inspection', 'Services related to inspecting and assessing plumbing systems');

INSERT INTO Services (service_id, service_type_id, service_name, description, price)
VALUES
  (1, 1, 'Pipe Repair', 'Fix leaky or broken pipes', 50.00),
  (2, 1, 'Drain Cleaning', 'Clear clogged drains and pipes', 75.00),
  (3, 2, 'Toilet Installation', 'Install a new toilet', 150.00),
  (4, 2, 'Sink Replacement', 'Replace an old or damaged sink', 200.00),
  (5, 1, 'Water Heater Repair', 'Fix issues with water heaters', 120.00),
  (6, 3, 'Plumbing Inspection', 'Inspect plumbing systems for potential issues', 100.00),
  (7, 1, 'Emergency Service', '24/7 emergency plumbing service', 250.00);

 * sqlite:///mario_bros_plumbing.db
3 rows affected.
7 rows affected.

[]

In [10]:
import sqlite3
import random
from datetime import datetime, timedelta

# Connect to the SQLite database
conn = sqlite3.connect('mario_bros_plumbing.db')
cursor = conn.cursor()

# Generate 500 random orders
for _ in range(500):
    # Select a random customer with weighted probabilities
    cursor.execute("SELECT customer_id FROM Customers ORDER BY RANDOM() * CASE "
                   "WHEN customer_id IN (1, 2, 3) THEN 3 "  # Customers 1, 2, and 3 are 3 times more likely
                   "WHEN customer_id IN (4, 5, 6) THEN 2 "  # Customers 4, 5, and 6 are 2 times more likely
                   "ELSE 1 END LIMIT 1")
    result = cursor.fetchone()
    if result is None:
        continue  # Skip this iteration if no customer is found
    customer_id = result[0]

    # Generate a random order date between 1985 and 2024
    start_date = datetime(1985, 1, 1)
    end_date = datetime(2024, 12, 31)
    time_between_dates = end_date - start_date
    days_between_dates = time_between_dates.days
    random_number_of_days = random.randrange(days_between_dates)
    order_date = start_date + timedelta(days=random_number_of_days)

    # Select a random employee hired before the order date
    employee_id = None  # Initialize employee_id with a default value
    cursor.execute("SELECT employee_id FROM Employees WHERE hire_date <= ? ORDER BY RANDOM() LIMIT 1",
                   (order_date.strftime('%Y-%m-%d'),))
    result = cursor.fetchone()
    if result is not None:
        employee_id = result[0]

    if employee_id is None:
        continue  # Skip this iteration if no suitable employee is found

    # Insert the order into the Orders table
    cursor.execute("INSERT INTO Orders (customer_id, employee_id, order_date) VALUES (?, ?, ?)",
                   (customer_id, employee_id, order_date.strftime('%Y-%m-%d')))
    order_id = cursor.lastrowid

    # Generate random order items for the order
    num_items = random.randint(1, 5)
    for _ in range(num_items):
        # Select a random service with weighted probabilities
        cursor.execute("SELECT service_id, price FROM Services ORDER BY RANDOM() * CASE "
                       "WHEN service_id IN (1, 2) THEN 3 "  # Services 1 and 2 are 3 times more likely
                       "WHEN service_id IN (3, 4) THEN 2 "  # Services 3 and 4 are 2 times more likely
                       "ELSE 1 END LIMIT 1")
        result = cursor.fetchone()
        if result is None:
            print("No service found for order", order_id)
            continue  # Skip this iteration if no service is found
        service_id, price = result

        # Generate a random quantity
        quantity = random.randint(1, 3)

        # Insert the order item into the Order_Items table
        cursor.execute("INSERT INTO Order_Items (order_id, service_id, quantity) VALUES (?, ?, ?)",
                       (order_id, service_id, quantity))

    # Update the total amount for the order
    cursor.execute("UPDATE Orders SET total_amount = (SELECT SUM(Services.price * Order_Items.quantity) "
                   "FROM Order_Items JOIN Services ON Order_Items.service_id = Services.service_id "
                   "WHERE Order_Items.order_id = ?) WHERE order_id = ?", (order_id, order_id))

# Commit the changes and close the connection
conn.commit()
conn.close()

In [11]:
%%sql
-- determine number of order per employee
SELECT employee_id, COUNT(*) AS num_orders
FROM Orders
GROUP BY employee_id
ORDER BY num_orders DESC;

 * sqlite:///mario_bros_plumbing.db
Done.

[(1, 101), (2, 63), (3, 50), (5, 37), (6, 29), (4, 18), (7, 10)]

In [12]:
%%sql
SELECT * FROM Order_Items LIMIT 10;

 * sqlite:///mario_bros_plumbing.db
Done.

[(1, 1, 1, 1),
 (2, 1, 4, 2),
 (3, 1, 1, 3),
 (4, 1, 2, 3),
 (5, 1, 1, 2),
 (6, 2, 3, 1),
 (7, 2, 2, 3),
 (8, 2, 2, 2),
 (9, 2, 3, 2),
 (10, 3, 2, 1)]

In [13]:
%%sql
-- Determine total amount spent by customer
SELECT Customers.first_name, Customers.last_name, SUM(total_amount) AS total_spent
FROM Orders
JOIN Customers ON Orders.customer_id = Customers.customer_id
GROUP BY Customers.customer_id
ORDER BY total_spent DESC;

 * sqlite:///mario_bros_plumbing.db
Done.

[('Daisy', 'Sarasa', 46210),
 ('Peach', 'Toadstool', 37110),
 ('Yoshi', 'Dino', 35635),
 ('Wario', 'Wario', 21465),
 ('Toadette', 'Toadstool', 20450),
 ('Bowser', 'Koopa', 18275),
 ('Birdo', 'Egg', 3935),
 ('Nabbit', 'Thief', 2400),
 ('Waluigi', 'Wario', 2295),
 ('Zelda', 'Hyrule', 2200),
 ('Lakitu', 'Cloud', 1810),
 ('Koopa', 'Troopa', 1645),
 ('Pikachu', 'Pokemon', 1450),
 ('Toadsworth', 'Toadstool', 1390),
 ('Dry', 'Bones', 1075),
 ('Diddy', 'Kong', 1065),
 ('Toad', 'Toadstool', 995),
 ('Roy', 'Pherae', 775),
 ('Funky', 'Kong', 600),
 ('Pauline', 'Toyopolis', 600),
 ('Cappy', 'Bonneter', 570),
 ('Cranky', 'Kong', 475),
 ('Link', 'Hyrule', 360),
 ('Fox', 'McCloud', 300),
 ('Donkey', 'Kong', 75)]